EDT/УТ/src/Documents/ЗапросНаПередачуЗаказовЭкипажу/ЗапросНаПередачуЗаказовЭкипажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаПередачуЗаказовЭкипажу</name>
  <registerRecords>InformationRegister.СтатусыЗапросовНаПередачуЗаказовЭкипажам</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИсточник</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсИсточник</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсПриемник</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортИсточник</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительИсточник</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторИсточник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортПриемник</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПриемник</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторПриемник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелПриемник</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыЗапросовНаПередачуЗаказовЭкипажам/СтатусыЗапросовНаПередачуЗаказовЭкипажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗапросовНаПередачуЗаказовЭкипажам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовНаПередачуЗаказовЭкипажам</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗапросНаПередачуЗаказовЭкипажу</name>
    <type>
      <types>DocumentRef.ЗапросНаПередачуЗаказовЭкипажу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СтатусыЗапросовНаПередачуЗаказовЭкипажам/СтатусыЗапросовНаПередачуЗаказовЭкипажам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовНаПередачуЗаказовЭкипажам</name>
  <enumValues>
    <name>ЗапросСоздан</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтклонен</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПодтвержден</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗапросНаПередачуЗаказовЭкипажу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыЗапросовНаПередачуЗаказовЭкипажам
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Записывать = Истина;
	Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Очистить();
	Движение = Движения.СтатусыЗапросовНаПередачуЗаказовЭкипажам.Добавить();
	Движение.Период = Дата;
	Движение.ЗапросНаПередачуЗаказовЭкипажу = Ссылка;
	Движение.СтатусЗапроса = Перечисления.СтатусыЗапросовНаПередачуЗаказовЭкипажам.ЗапросСоздан;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
